//
//  HabitsInfo.swift
//  MyHabits
//
//  Created by Александр on 03.03.2023.
//

import UIKit
let habitsViewControllerTitle = "Сегодня"
let InfoViewControllerTitle = "Информация"
let habitNameTitle = "НАЗВАНИЕ"
let habitNamePlaceholder = "Бегать по утрам, спать 8 часов и т.п."
let habitColorTitle = "ЦВЕТ"
let habitDateTitle = "ВРЕМЯ"
let habitDateDescriptionPattern = "Каждый день в "
let progressHeader = "Все получится!"
let detailsTableHeader = "АКТИВНОСТЬ"
let infoTitle = "Привычка за 21 день"

let infoDescription = """
Прохождение этапов, за которые за 21 день вырабатывается привычка, подчиняется следующему алгоритму:

1. Провести 1 день без обращения к старым привычкам, стараться вести себя так, как будто цель, загаданная в перспективу, находится на расстоянии шага.

2. Выдержать 2 дня в прежнем состоянии самоконтроля.

3. Отметить в дневнике первую неделю изменений и подвести первые итоги — что оказалось тяжело, что — легче, с чем еще предстоит серьезно бороться.

4. Поздравить себя с прохождением первого серьезного порога в 21 день. За это время отказ от дурных наклонностей уже примет форму осознанного преодоления и человек сможет больше работать в сторону принятия положительных качеств.

5. Держать планку 40 дней. Практикующий методику уже чувствует себя освободившимся от прошлого негатива и двигается в нужном направлении с хорошей динамикой.

6. На 90-й день соблюдения техники все лишнее из «прошлой жизни» перестает напоминать о себе, и человек, оглянувшись назад, осознает себя полностью обновившимся.

Источник: psychbook.ru
"""
